---
kind: property
id: P:Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintPearlColorByObject
source: html/04effa37-2b8e-ab13-c8a9-14548a11011c.htm
---
# Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintPearlColorByObject Property

The property labeled "Color By Object" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public static string MetallicpaintPearlColorByObject { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".